# Importing Libraries

In [171]:
import pandas as pd
import sqlite3
import warnings
warnings.filterwarnings("ignore", category=UserWarning)

### Load orders data (CSV)

In [9]:
orders = pd.read_csv(r"C:\Users\saikr\Downloads\orders.csv")
orders

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian
...,...,...,...,...,...,...
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian
9996,9997,2867,267,06-08-2023,1188.05,Darbar Cafe Punjabi
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian
9999,10000,457,439,21-10-2023,879.58,Classic Cafe Family Restaurant

In [11]:
orders.head() # to get first 5 rows of orders dataset

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

### Load users data (JSON)

In [16]:
users = pd.read_json(r"C:\Users\saikr\Downloads\users.json")
users

      user_id       name       city membership
0           1     User_1    Chennai    Regular
1           2     User_2       Pune       Gold
2           3     User_3  Bangalore       Gold
3           4     User_4  Bangalore    Regular
4           5     User_5       Pune       Gold
...       ...        ...        ...        ...
2995     2996  User_2996  Hyderabad       Gold
2996     2997  User_2997  Hyderabad    Regular
2997     2998  User_2998  Bangalore    Regular
2998     2999  User_2999       Pune    Regular
2999     3000  User_3000  Hyderabad       Gold

[3000 rows x 4 columns]

In [18]:
users.head() # to get first 5 rows ofusers dataset

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

### Load restaurants data (SQL)

In [67]:

import sqlite3
import pandas as pd

db_path = r"C:\Users\saikr\Downloads\restaurants.db"
# connect with mysql 
conn = sqlite3.connect(db_path)
cursor = conn.cursor()

In [69]:
sql_path = r"C:\Users\saikr\Downloads\intern_restuarant.sql"

with open(sql_path, "r", encoding="utf-8") as file:
    sql_script = file.read()

In [71]:
clean_sql = []

for line in sql_script.splitlines():
    l = line.strip().lower()
    if l.startswith("create database"):
        continue
    if l.startswith("use "):
        continue
    if l.startswith("drop database"):
        continue
    clean_sql.append(line)

clean_sql_script = "\n".join(clean_sql)

In [73]:
cursor.executescript(clean_sql_script)
conn.commit()

In [75]:
pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';",conn)

          name
0  restaurants

In [81]:
restaurants = pd.read_sql("SELECT * FROM restaurants", conn)
restaurants

     restaurant_id restaurant_name  cuisine  rating
0                1    Restaurant_1  Chinese     4.8
1                2    Restaurant_2   Indian     4.1
2                3    Restaurant_3  Mexican     4.3
3                4    Restaurant_4  Chinese     4.1
4                5    Restaurant_5  Chinese     4.8
..             ...             ...      ...     ...
495            496  Restaurant_496   Indian     3.1
496            497  Restaurant_497  Mexican     4.4
497            498  Restaurant_498  Chinese     3.9
498            499  Restaurant_499  Mexican     4.9
499            500  Restaurant_500  Chinese     3.2

[500 rows x 4 columns]

In [83]:
restaurants.head() # to get first 5 rows from restuarnts dataset

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [85]:
# checking the no of rows and coumns and to get first 5 rows of datset
print(restaurants.shape)
print(restaurants.head())

(500, 4)
   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [87]:
# we are merging two dataset users and orders by using merge 
orders_users = pd.merge(orders,users,on="user_id",how="left")

In [89]:
# from above we merged orders and users into one variable called orders_users now we can merge with this resturants inorder to get complete 3 tables together
final_df = pd.merge(orders_users,restaurants,on="restaurant_id",how="left")

In [91]:
# afteer merging we are checking the shape and first 5 rows of merged final dataset
final_df.head()
final_df.shape

(10000, 12)

In [93]:
final_df.to_csv(r"C:\Users\saikr\Downloads\final_food_delivery_dataset.csv",index=False)

In [95]:
# inorder to check shape of all data inorder to verify the data is missed or not in final datset
print("Orders:", orders.shape)
print("Users:", users.shape)
print("Restaurants:", restaurants.shape)

Orders: (10000, 6)
Users: (3000, 4)
Restaurants: (500, 4)

In [97]:
# to check how many rows are there in final datset 
final_df['order_id'].nunique()

10000

In [99]:
# to check whether null valyues are present are not
final_df['restaurant_id'].isna().sum()

0

In [183]:
# Converting order_date column into datetime format for monthly analysis
final_df['order_date'] = pd.to_datetime(final_df['order_date'])
# Grouping data by month and counting total orders
final_df.groupby(final_df['order_date'].dt.month)['order_id'].count()

order_date
1     831
2     785
3     903
4     812
5     844
6     784
7     859
8     851
9     812
10    863
11    807
12    849
Name: order_id, dtype: int64

In [103]:
# Grouping data by user_id and counting total orders for each user
final_df.groupby('user_id')['order_id'].count()

user_id
1        1
2       10
3        2
4        4
5        5
        ..
2996     3
2997     5
2998     6
2999     1
3000     2
Name: order_id, Length: 2883, dtype: int64

In [105]:
final_df.groupby('city')['order_id'].count()

city
Bangalore    2751
Chennai      2469
Hyderabad    2350
Pune         2430
Name: order_id, dtype: int64

In [107]:
final_df.groupby('cuisine')['order_id'].count()

cuisine
Chinese    2418
Indian     2469
Italian    2532
Mexican    2581
Name: order_id, dtype: int64

In [117]:
# Which city has the highest total revenue from Gold members?
(final_df[final_df['membership'] == 'Gold'].groupby('city')['total_amount'].sum().sort_values(ascending=False))

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [119]:
#Which cuisine has the highest average order value across all orders?

(final_df.groupby('cuisine')['total_amount'].mean().sort_values(ascending=False))

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [121]:
#How many distinct users placed orders worth more than ₹1000 in total (sum of all their orders)?
user_spend = (final_df.groupby('user_id')['total_amount'].sum())
user_spend[user_spend > 1000].count()

2544

In [123]:
#Which restaurant rating range generated the highest total revenue?

bins = [3.0, 3.5, 4.0, 4.5, 5.0]
labels = ['3.0–3.5', '3.6–4.0', '4.1–4.5', '4.6–5.0']

final_df['rating_range'] = pd.cut(final_df['rating'],bins=bins,labels=labels,include_lowest=True)

In [181]:
(
    final_df.groupby('rating_range')['total_amount']
    .sum()
    .sort_values(ascending=False)
)

C:\Users\saikr\AppData\Local\Temp\ipykernel_17024\2382319292.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  final_df.groupby('rating_range')['total_amount']

rating_range
4.6–5.0    2197030.75
3.0–3.5    2136772.70
4.1–4.5    1960326.26
3.6–4.0    1717494.41
Name: total_amount, dtype: float64

In [127]:
#Among Gold members, which city has the highest average order value?

(final_df[final_df['membership'] == 'Gold'].groupby('city')['total_amount'].mean().sort_values(ascending=False))

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [129]:
#Which cuisine has the lowest number of distinct restaurants but still contributes significant revenue?
restaurant_count = (final_df.groupby('cuisine')['restaurant_id'].nunique())
cuisine_revenue = (final_df.groupby('cuisine')['total_amount'].sum())
summary = pd.concat( [restaurant_count, cuisine_revenue], axis=1)
summary.columns = ['restaurant_count', 'total_revenue']
summary.sort_values(['restaurant_count', 'total_revenue'],ascending=[True, False])

         restaurant_count  total_revenue
cuisine
Chinese               120     1930504.65
Italian               126     2024203.80
Indian                126     1971412.58
Mexican               128     2085503.09

# What percentage of total orders were placed by Gold members? (Rounded to nearest integer)

gold_orders = final_df[final_df['membership'] == 'Gold'].shape[0]
total_orders = final_df.shape[0]
round((gold_orders / total_orders) * 100)

In [151]:
#Which restaurant has the highest average order value but less than 20 total orders?
options = ['Grand Cafe Punjabi','Grand Restaurant South Indian','Ruchi Mess Multicuisine','Ruchi Foods Chinese']

filtered = ( final_df[final_df['restaurant_name_x'].isin(options)].groupby('restaurant_name_x').agg(
avg_order_value=('total_amount', 'mean'),total_orders=('order_id', 'count') ))

filtered[filtered['total_orders'] < 20].sort_values('avg_order_value',ascending=False)

                     avg_order_value  total_orders
restaurant_name_x
Ruchi Foods Chinese       686.603158            19

In [153]:
#Which combination contributes the highest revenue?
(final_df.groupby(['membership', 'cuisine'])['total_amount'].sum().sort_values(ascending=False))

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [155]:
#During which quarter of the year is the total revenue highest?
final_df['order_date'] = pd.to_datetime(final_df['order_date'],format="%d-%m-%Y")

final_df['quarter'] = final_df['order_date'].dt.quarter

(final_df.groupby('quarter')['total_amount'].sum().sort_values(ascending=False))

quarter
3    2037385.10
4    2018263.66
1    2010626.64
2    1945348.72
Name: total_amount, dtype: float64

In [157]:
#How many total orders were placed by users with Gold membership?
gold_orders_count = final_df[final_df['membership'] == 'Gold'].shape[0]
gold_orders_count

4987

In [159]:
#What is the total revenue (rounded to nearest integer) generated from orders placed in Hyderabad city?
hyderabad_revenue = (final_df[final_df['city'] == 'Hyderabad']['total_amount'].sum().round())
hyderabad_revenue

1889367.0

In [161]:
#How many distinct users placed at least one order?
distinct_users = final_df['user_id'].nunique()
distinct_users

2883

In [163]:
#What is the average order value (rounded to 2 decimals) for Gold members?
avg_order_gold = (final_df[final_df['membership'] == 'Gold']['total_amount'].mean().round(2))
avg_order_gold

797.15

In [165]:
#How many orders were placed for restaurants with rating ≥ 4.5?
high_rating_orders = final_df[final_df['rating'] >= 4.5].shape[0]
high_rating_orders

3374

In [167]:
#How many orders were placed in the top revenue city among Gold members only?
top_gold_city = (final_df[final_df['membership'] == 'Gold'].groupby('city')['total_amount'].sum().idxmax())
top_gold_city

'Chennai'

In [169]:
orders_top_gold_city = final_df[(final_df['membership'] == 'Gold') &(final_df['city'] == top_gold_city)
].shape[0]
orders_top_gold_city

1337